No imports, empty state.
Started out with an empty directory, only this terraform code in a file:
```
terraform {
  required_providers {
    ec = {
      source  = "elastic/ec"
      version = "0.1.0-beta"
    }
  }
}

provider "ec" {
  verbose = true
}

resource "ec_deployment" "example_minimal" {
  name = "my_example_deployment"
  region                 = "us-east-1"
  version                = "7.9.2"
  deployment_template_id = "aws-io-optimized-v2"

  elasticsearch {}
  kibana {}
  apm {}
  enterprise_search {}
}
```
Then I run it exactly like this:
```
$ terraform init
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of elastic/ec from the dependency lock file
- Using previously-installed elastic/ec v0.1.0-beta

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ec_deployment.example_minimal will be created
  + resource "ec_deployment" "example_minimal" {
      + apm_secret_token       = (sensitive value)
      + deployment_template_id = "aws-io-optimized-v2"
      + elasticsearch_password = (sensitive value)
      + elasticsearch_username = (known after apply)
      + id                     = (known after apply)
      + name                   = "my_example_deployment"
      + region                 = "us-east-1"
      + version                = "7.9.2"

      + apm {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-apm"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)
          + version                      = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }

      + elasticsearch {
          + cloud_id       = (known after apply)
          + http_endpoint  = (known after apply)
          + https_endpoint = (known after apply)
          + ref_id         = "main-elasticsearch"
          + region         = (known after apply)
          + resource_id    = (known after apply)
          + version        = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + node_type_data            = (known after apply)
              + node_type_ingest          = (known after apply)
              + node_type_master          = (known after apply)
              + node_type_ml              = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }

      + enterprise_search {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-enterprise_search"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)
          + version                      = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + node_type_appserver       = (known after apply)
              + node_type_connector       = (known after apply)
              + node_type_worker          = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }

      + kibana {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-kibana"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)
          + version                      = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ec_deployment.example_minimal: Creating...

Error: failed creating deployment: 2 errors occurred:
        * api error: clusters.cluster_plan_change_prohibited: The requested cluster configuration change is not permitted. Value of field 'elasticsearch.version' cannot be changed to [7.9.2]. (resources.elasticsearch[0].elasticsearch.version)
        * set "request_id" to "kmtayvyk8wu44ktt7dk3fmswau2itrpzod1vlhslk0ozlkpqdps3jtsey6o9vkp0" to recreate the deployment resources



  on elasticsearch.tf line 1, in resource "ec_deployment" "example_minimal":
   1: resource "ec_deployment" "example_minimal" {

$
```
